import React from "react";
import { useNavigate } from "react-router-dom";

export const Policy = () => {
    const navigate = useNavigate();
    return (
        <div>
            <button
                onClick={() => navigate(-1)}
                style={{ marginBottom: "50px", width: "100px" }}
            >
                Вернуться на главную
            </button>
            <br />
            Политика конфиденциальности
            <br /> 1. Общие положения
            <br />
            1.1. Политика в отношении обработки и защиты персональных данных
            (далее — «Политика») разработана в соответствии с Законом Республики
            Беларусь «Об информации, информатизации и защите информации», иным
            законодательством Республики Беларусь в целях исполнения ООО
            «Торговый Дом «Династия Спорта» (далее по тексту — «Общество»)
            функций оператора персональных данных.
            <br />
            <br />
            1.2. Политика действует в отношении всех персональных данных,
            обрабатываемых в Обществе, которые могут быть получены от субъектов
            персональных данных (далее Субъекты):
            <br />
            <br />
            участников Общества и аффилированных лиц Общества;
            <br />
            с которыми Обществом заключены (будут заключены, планируются к
            заключению) сделки;
            <br />
            предоставивших Обществу персональные данные в процессе регистрации
            Субъекта на интернет-сайте https://multisports.by (далее Сайт);
            <br />
            предоставивших Обществу персональные данные путем заполнения
            письменных, электронных анкет в ходе проводимых Обществом рекламных
            и иных мероприятий;
            <br />
            предоставивших Обществу персональные данные иным путем.
            <br />
            1.3. Целью Политики является защита интересов Субъектов и Общества.
            <br />
            <br />
            1.4. Сбор, обработка и хранение персональных данных в Обществе
            основаны на принципах обеспечения защиты прав и свобод человека и
            гражданина, в том числе защиты прав на неприкосновенность частной
            жизни, личную и семейную тайну.
            <br />
            <br />
            1.5. Действие Политики распространяется на процессы Общества, в
            которых осуществляется сбор, обработка и хранение персональных
            данных Субъектов.
            <br />
            <br />
            1.6. В тексте Политики использующиеся термины и понятия
            употребляются в значениях, применяемых в действующем
            законодательстве Республики Беларусь.
            <br />
            <br />
            1.7. Политика является общедоступной и размещается в информационной
            сети Интернет на Сайте по адресу
            https://multisports.by/info/politika-konfidentsialnosti/.
            <br />
            <br />
            1.8. Общество может получать следующие персональные данные:
            <br />
            <br />
            фамилия, имя, отчество;
            <br />
            пол;
            <br />
            адрес полный или частичный;
            <br />
            дата рождения;
            <br />
            адрес электронной почты, другие аккаунты в службах электронного
            обмена информацией;
            <br />
            контактные телефоны.
            <br />
            Также Общество может собирать информацию технического и иного
            характера:
            <br />
            <br />
            файлы Cookies;
            <br />
            IP-адрес пользователя;
            <br />
            логин и пароль Субъекта;
            <br />
            иные данные, указанные в договорах, соглашениях, анкетах, формах и
            прочих подобных документах, заполняемых Субъектом;
            <br />
            история покупок.
            <br />
            2. Принципы обработки персональных данных
            <br />
            <br />
            <br />
            2.1. Обработка персональных данных в Обществе осуществляется в
            соответствии со следующими принципами:
            <br />
            <br />
            обработка персональных данных осуществляется на законной основе;
            <br />
            обработка персональных данных ограничивается достижением конкретных,
            заранее определенных и законных целей. Не допускается обработка
            персональных данных, несовместимая с целями сбора персональных
            данных;
            <br />
            не допускается объединение баз данных, содержащих персональные
            данные, обработка которых осуществляется в целях, несовместимых
            между собой;
            <br />
            обработке подлежат только те персональные данные, которые отвечают
            целям их обработки;
            <br />
            содержание и объем обрабатываемых персональных данных соответствуют
            заявленным целям обработки. Обрабатываемые персональные данные не
            являются избыточными по отношению к заявленным целям обработки;
            <br />
            при обработке персональных данных обеспечивается точность
            персональных данных, их достаточность, а в необходимых случаях и
            актуальность по отношению к заявленным целям их обработки;
            <br />
            хранение персональных данных осуществляется в форме, позволяющей
            определить субъекта персональных данных не дольше, чем этого требуют
            цели обработки персональных данных, если иной срок хранения
            персональных данных не установлен законодательством, договором;
            <br />
            предоставленные персональные данные остаются в первичном виде и не
            изменяются в процессе сбора и обработки данных;
            <br />
            Общество не осуществляет передачу персональных данных нерезидентам
            Республики Беларусь;
            <br />
            Общество имеет право обрабатывать общедоступные персональные данные,
            осуществлять обработку персональных данных, подлежащих обязательному
            раскрытию в соответствии с законодательством Республики Беларусь;
            <br />
            Общество имеет право поручить обработку персональных данных другому
            лицу;
            <br />
            Общество не имеет права получать и обрабатывать персональные данные
            Пользователя касательно его расовой, национальной принадлежности,
            политических взглядов, религиозных или философских убеждений и
            интимной жизни;
            <br />
            персональные данные относятся к категории конфиденциальной
            информации.
            <br />
            3. Действия, осуществляемые с персональными данными
            <br />
            <br />
            <br />
            3.1. Общество осуществляет сбор (получение), обработку (запись,
            систематизацию, накопление, уточнение, обновление, изменение,
            извлечение, использование), хранение, передачу (распространение,
            предоставление доступа), уничтожение (обезличивание, блокирование,
            удаление) персональных данных в целях, указанных в Политике.
            <br />
            <br />
            3.2. Общество осуществляет обработку персональных данных с
            использованием средств автоматизации и без использования таких
            средств, а также смешанным образом, в т.ч. в
            информационно-телекоммуникационных сетях, в целях, указанных в
            Политике.
            <br />
            <br />
            3.3. Общество принимает необходимые меры по удалению или уточнению
            неполных или неточных данных.
            <br />
            <br />
            <br />
            4. Использование и передача персональных данных
            <br />
            <br />
            <br />
            4.1. Общество собирает, хранит и обрабатывает персональные данные в
            целях:
            <br />
            <br />
            обеспечения реализации трудовых, гражданско-правовых, бухгалтерских,
            налоговых отношений, заключения и исполнения трудовых,
            гражданско-правовых договоров, в том числе публичных;
            <br />
            реализации акций, бонусных программ, рекламных и иных мероприятий;
            <br />
            отправки коммерческих предложений и информации;
            <br />
            улучшения качества товаров и услуг Общества, предоставления и
            продвижения товаров и услуг Общества, отправки уведомлений,
            коммерческих предложений, предоставления информации о деятельности
            Общества;
            <br />
            предоставления различных сервисов Сайтом;
            <br />
            идентификации Субъекта – зарегистрированного пользователя Сайта.
            Также эти данные могут быть отображены на страницах Сайта при его
            использовании указанным пользователем.
            <br />
            использования в рассылках (почтовых, по электронной почте, с
            использованием СМС, других служб обмена сообщениями (Viber) для
            передачи Пользователю информации о новых товарах, акциях и других
            новостях Общества, на получение которой Субъект дал свое согласие в
            письменной или иной не запрещенной законодательством форме. Субъект
            всегда может отказаться от проведения рассылки по его контактной
            информации;
            <br />
            обработки статистической информации;
            <br />
            направления уведомлений, информации и запросов, связанных со сбором,
            хранением и обработкой персональных данных.
            <br />
            4.2. Общество передает персональные данные:
            <br />
            <br />
            Субъекту – без ограничений, кроме случаев, прямо предусмотренных
            требованиями законодательства Республики Беларусь;
            <br />
            другим лицам – в случаях, предусмотренных требованиями
            законодательства Республики Беларусь.
            <br />
            4.3. Субъект, предоставляющий персональные данные Обществу, несет
            ответственность за точность, достоверность и актуальность
            предоставляемых персональных данных в соответствии с
            законодательством Республики Беларусь. Общество имеет право
            осуществлять проверку точности, достоверности и актуальности
            предоставляемых персональных данных в случаях, объеме и порядке,
            предусмотренных законодательством Республики Беларусь. Субъект,
            предоставляющий персональные данные Обществу, предоставляет Обществу
            право получать, хранить, обрабатывать, использовать и раскрывать
            персональные данные на условиях Политики.
            <br />
            <br />
            4.4. Согласие на обработку персональных данных может быть отозвано
            Субъектом. В случае отзыва Субъектом согласия на обработку
            персональных данных Общество прекращает обработку указанных
            персональных данных и при необходимости уничтожает (обезличивает)
            их. При удалении персональных данных Субъект принимает на себя
            ответственность за последствия удаления. Субъект вправе требовать от
            оператора Общества своих персональных данных, их блокирования или
            уничтожения в случае, если персональные данные являются неполными,
            устаревшими, недостоверными, незаконно полученными или не являются
            необходимыми для заявленной цели обработки, а также принимать
            предусмотренные законом меры по защите своих прав. Право Субъекта на
            доступ к его персональным данным может быть ограничено в случаях и в
            порядке, установленных законодательством Республики Беларусь.
            <br />
            <br />
            4.5. Персональные данные хранятся:
            <br />
            <br />
            на бумажных носителях;
            <br />
            в форме компьютерных файлов;
            <br />
            в специализированных системах Общества, обеспечивающих
            автоматическую обработку, хранение информации.
            <br />
            <br />
            5. Условия обработки персональных данных
            <br />
            <br />
            <br />
            5.1. Обработка персональных данных в Обществе допускается только с
            соблюдением требований законодательства Республики Беларусь.
            <br />
            <br />
            5.2. Общество обязано получать согласие Субъектов на их обработку в
            прямо предусмотренных законодательством Республики Беларусь случаях.
            <br />
            <br />
            5.3. При условии получения Обществом письменного согласия Субъектов
            Общество может включить их персональные данные в общедоступные
            источники персональных данных.
            <br />
            <br />
            5.4. Поручение обработки персональных данных третьему лицу
            осуществляется Обществом только на основании договора, заключенного
            между Обществом и третьим лицом, либо ином основании,
            предусмотренном законодательством Республики Беларусь. При этом
            Общество фиксирует в договоре обязанность лица, осуществляющего
            обработку персональных данных по поручению Общества, соблюдать
            принципы и правила обработки персональных данных, предусмотренные
            Политикой и законодательством Республики Беларусь.
            <br />
            <br />
            5.5. В случае если Общество поручает обработку персональных данных
            другому лицу, ответственность перед субъектом персональных данных за
            действия указанного лица несет Общество. Лицо, осуществляющее
            обработку персональных данных по поручению Общества, несет
            ответственность перед Обществом.
            <br />
            <br />
            5.6. Общество обязывает иных лиц, получивших доступ к персональным
            данным, не раскрывать их третьим лицам и не распространять их без
            согласия субъекта персональных данных, если иное не предусмотрено
            законодательством Республики Беларусь.
            <br />
            <br />
            <br />
            6. Права Субъекта
            <br />
            <br />
            <br />
            6.1. Субъект персональных данных осуществляет свои права в объеме и
            порядке, установленных законодательством Республики Беларусь.
            <br />
            <br />
            6.2. Субъект вправе требовать от Общества состав имеющихся у
            Общества персональных данных данного Субъекта и источник получения.
            <br />
            <br />
            <br />
            7. Обязанности Общества
            <br />
            <br />
            <br />
            7.1. Общество выполняет обязанности оператора персональных данных в
            объеме и порядке, установленных законодательством Республики
            Беларусь.
            <br />
            <br />
            <br />
            8. Реализация Обществом требований к защите персональных данных
            <br />
            <br />
            <br />
            8.1. Реализацию требований к защите персональных данных от
            неправомерного или случайного доступа к персональным данным, их
            уничтожения, изменения, блокирования, копирования, распространения,
            а также от иных неправомерных действий с персональными данными,
            Общество осуществляет различными мерами в соответствии с
            законодательством Республики Беларусь.
            <br />
            <br />
            8.2. Правовые меры включают в себя:
            <br />
            <br />
            разработку и применение нормативных документов по обработке и защите
            персональных данных в Обществе;
            <br />
            включение в соглашения, заключаемые Обществом с контрагентами,
            требований обеспечения безопасности персональных данных;
            <br />
            8.3. Организационные меры включают в себя:
            <br />
            <br />
            назначение ответственных за организацию обработки и обеспечение
            безопасности персональных данных;
            <br />
            ознакомление работников Общества с требованиями законодательства
            Республики Беларусь и нормативных документов Общества в области
            обработки и защиты персональных данных;
            <br />
            установление ответственности работников за обеспечение безопасности
            обрабатываемых данных;
            <br />
            организацию внутреннего контроля обработки и обеспечения
            безопасности персональных данных;
            <br />
            контроль выполнения подразделениями, должностными лицами и
            работниками Общества требований законодательства Республики Беларусь
            и нормативных документов Общества по обработке и защите персональных
            данных;
            <br />
            классификацию персональных данных, согласно положениям и требованиям
            законодательства Республики Беларусь;
            <br />
            своевременное выявление и устранение угроз безопасности персональных
            данных;
            <br />
            принятие мер в целях исключения фактов несанкционированного доступа
            к персональным данным, восстановление персональных данных,
            модифицированных или уничтоженных вследствие несанкционированного
            доступа к ним;
            <br />
            организация учета, хранения и уничтожения носителей персональных
            данных;
            <br />
            организация контроля доступа в помещения и здания Общества;
            <br />
            организация и реализация системы ограничения/разграничения доступа
            пользователей (работников) к документам, информационным ресурсам,
            техническим средствам и носителям информации, информационным
            системам и связанным с их использованием работам.
            <br />
            8.4. Технические меры принимаются Обществом в соответствии с
            требованиями законодательства Республики Беларусь. Сведения о
            конкретных применяемых технических мерах защиты персональных данных
            являются конфиденциальной информацией и раскрываются Обществом
            только в случаях и в порядке, предусмотренных законодательством
            Республики Беларусь.
            <br />
            <br />
            8.5. Помимо указанных в настоящем пункте при необходимости могут
            применяться иные необходимые для защиты персональных данных меры.
            <br />
            <br />
            <br />
            9. Заключительные положения
            <br />
            <br />
            <br />
            9.1. Политика является внутренним документом Общества. Общество при
            необходимости в одностороннем порядке вносит в Политику
            соответствующие изменения с последующим размещением новой Политики
            на Сайте. Субъекты самостоятельно получают на Сайте информацию об
            изменениях.
            <br />
            <br />
            9.2. В случае, если какое-либо положение Политики, включая любое
            предложение, пункт или их часть, признается противоречащим
            законодательству или недействительным, остальные положения, которые
            не противоречат законодательству, остаются в силе и являются
            действительными, а любое недействительное положение или положение,
            которое не может быть выполнено без дальнейших действий Сторон,
            считается удаленным, измененным, исправленным в той мере, в какой
            это необходимо для обеспечения его действительности и возможности
            выполнения.
            <br />
            <br />
        </div>
    );
};
